---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalSegment
source: html/a36b0175-dd17-c1b0-99ea-542c476e832f.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalSegment Method

Gets the analytical segment at the current iteration step.

## Syntax (C#)
```csharp
public MEPAnalyticalSegment GetAnalyticalSegment()
```

## Returns
The retrieved segment, may be null for the first step.